Ran Plan for 4 projects:

1. project: `iam/bhuny-id` dir: `terraform/iam/bhuny-id` workspace: `default`
1. project: `ssm/bhuny-id/ap-northeast-2` dir: `terraform/ssm/bhuny-id/ap-northeast-2` workspace: `default`
1. project: `securitygroup/bhuny-id/bhunyd_apnortheast2` dir: `terraform/securitygroup/bhuny-id/bhunyd_apnortheast2` workspace: `default`
1. project: `github/terraform-provisioning` dir: `github/terraform-provisioning` workspace: `default`

### 1. project: `iam/bhuny-id` dir: `terraform/iam/bhuny-id` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p iam/bhuny-id`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-645292925.ap-northeast-2.elb.amazonaws.com/lock?id=sehoon99%252Fterraform-provisioning%252Fterraform%252Fiam%252Fbhuny-id%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p iam/bhuny-id`

---
### 2. project: `ssm/bhuny-id/ap-northeast-2` dir: `terraform/ssm/bhuny-id/ap-northeast-2` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p ssm/bhuny-id/ap-northeast-2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-645292925.ap-northeast-2.elb.amazonaws.com/lock?id=sehoon99%252Fterraform-provisioning%252Fterraform%252Fssm%252Fbhuny-id%252Fap-northeast-2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p ssm/bhuny-id/ap-northeast-2`

---
### 3. project: `securitygroup/bhuny-id/bhunyd_apnortheast2` dir: `terraform/securitygroup/bhuny-id/bhunyd_apnortheast2` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_security_group.codebuild_deployment will be created
+ resource "aws_security_group" "codebuild_deployment" {
      + arn                    = (known after apply)
      + description            = "codebuild-deployment secrutiy group for bhunyd_apnortheast2"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "any outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "codebuild-deployment-bhunyd_apnortheast2"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0e437f8adc6609c4f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ codebuild_deployment_id = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p securitygroup/bhuny-id/bhunyd_apnortheast2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-645292925.ap-northeast-2.elb.amazonaws.com/lock?id=sehoon99%252Fterraform-provisioning%252Fterraform%252Fsecuritygroup%252Fbhuny-id%252Fbhunyd_apnortheast2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p securitygroup/bhuny-id/bhunyd_apnortheast2`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 4. project: `github/terraform-provisioning` dir: `github/terraform-provisioning` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # github_actions_variable.example will be created
+ resource "github_actions_variable" "example" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "terraform-provisioning"
      + updated_at    = (known after apply)
      + value         = "example_variable_value"
      + variable_name = "example_variable_name"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p github/terraform-provisioning`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-645292925.ap-northeast-2.elb.amazonaws.com/lock?id=sehoon99%252Fterraform-provisioning%252Fgithub%252Fterraform-provisioning%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p github/terraform-provisioning`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
